mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE987x_DFP.1.4.2.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <license>Licence/CMSIS_END_USER_LICENCE_AGREEMENT.txt</license>  
  <vendor>Infineon</vendor>
  <url>https://www.infineon.com/cmsis_packs/TLE987x/</url>
  <name>TLE987x_DFP</name>
  <description>Infineon TLE987x Series Device Support</description>
  <supportContact>http://www.infineon.com/cms/en/corporate/company/contact/support/index.html</supportContact>
  
  <releases>
   <release version="1.4.2">
        ARMCC v6 compatibility added
        BLDC Block Commutation with HALL example fixed
		BLDC FOC example fixed
		LIN Master example fixed
		DMA module updated to be ARMCC v6 compartible
		Config Wizard XMLs updated
		IRAMx ranges modified
        compatible devices for evalboards updated
   </release>
   <release version="1.4.0">
        SDADC module updated
        PMU added to minimum configuration
        TLE9879-2QXA40 datasheet added
        SDK MISRA 2012 compliant
        flash algorithm for data flash added, TLE9879-2QXA40 added
        Compability with both version of Config Wizard added
        TLE987x Eval.Board added
        SDADC TMR example added
   </release>
   <release version="1.3.2">
        adc2, dma, pmu, bdrv updated
   </release>
   <release version="1.3.1">
        SDK DMA.c updated
   </release>
   <release version="1.3.0">
        project structure changed to local SDK
   </release>
   <release version="1.2.5">
      TLE9873 memory layout fixed
      SVD updated
      SDK updated
      new IFXConfigWizard XML file
   </release>
   <release version="1.2.4">
      SDK update, ISR.C and SCU.C
      DMA added
      TLE9873QXW40, TLE9877QXW40, TLE9879QXW40 added
   </release>
   <release version="1.2.3">
      SDK update
      BLDC BC HALL Example added
      NVM Data Flash Handling example added
    </release>
   <release version="1.2.2">
      SVD update
    </release>
   <release version="1.2.1">
      updated pdsc file, updated example structure
    </release>
   <release version="1.2.0">
      updated pdsc file, updated example structure
    </release>
   <release version="1.1.0">
      TLE987x Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Infineon</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Infineon</keyword>
    <keyword>TLE987x</keyword>
  </keywords>

  <devices>
    <family Dfamily="TLE98xx Series" Dvendor="Infineon:7">
      <processor Dcore="Cortex-M3" DcoreVersion="r0p0" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian"/>

      <description>
        The TLE987x series is designed for 3-phase motor drive applications with LIN/PWM interface
        - Ultra low power consumption
        - Nested Vectored Interrupt Controller (NVIC)
        - integrated LIN tranceiver (selected derivates)
        - DMA (selected derivates)
        - Current Sense Amplifier (selected drivates)
      </description>
 
      <environment name="uv">
      </environment>

      <feature type="WDT"           n="1"/>
      <feature type="ComOther"      n="2"                           name="Universal Serial Interface"/>
      <feature type="Temp"          n="-40"     m="150"             name="all Devices"/>


      <subFamily DsubFamily="TLE987x Series">

          <device Dname="TLE9871QXA20">
            <processor Dclock="24000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9871QXA20"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0x7FFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x11007FFC"  size="0x1004"     startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0xBE8"      init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x10"       init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9871.FLM"        start="0x11000000"  size="0x9000"                   default="1"/>
            <algorithm  name="Flash/TLE9871_EEP.FLM"    start="0x11008000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE987x BE-Step Series BootROM Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x BF-Step Series BootROM Manual"/>
            <book    name="Documents/TLE9871QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9871QXA20 Data Sheet - BE-Step"/>
            <book    name="Documents/TLE9871QXA20-BF-Data-Sheet-10-Infineon.pdf"  title="TLE9871QXA20 Data Sheet - BF-Step"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
          <device Dname="TLE9873QXW40">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9873QXW40;RTE_DEVICE_BF_STEP"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0xAFFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x1100AFFC"  size="0x1004"     startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0xBE8"      init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x14"       init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9873.FLM"        start="0x11000000"  size="0xB000"                   default="1"/>
            <algorithm  name="Flash/TLE9873_EEP.FLM"    start="0x1100B000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x Series BootROM Manual"/>
            <book    name="Documents/TLE9873QXW40-BF-Data-Sheet-11-Infineon.pdf"  title="TLE9873QXW40 Data Sheet"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
          <device Dname="TLE9877QXA20">
            <processor Dclock="24000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9877QXA20"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0xEFFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x1100EFFC"  size="0x1004"     startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"     init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x10"       init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9877.FLM"        start="0x11000000"  size="0xF000"                   default="1"/>
            <algorithm  name="Flash/TLE9877_EEP.FLM"    start="0x1100F000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE987x BE-Step Series BootROM Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x BF-Step Series BootROM Manual"/>
            <book    name="Documents/TLE9877QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9877QXA20 Data Sheet - BE-Step"/>
            <book    name="Documents/TLE9877QXA20-BF-Data-Sheet-10-Infineon.pdf"  title="TLE9877QXA20 Data Sheet - BF-Step"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
          <device Dname="TLE9877QXA40">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9877QXA40"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0xEFFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x1100EFFC"  size="0x1004"     startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"     init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x10"       init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9877.FLM"        start="0x11000000"  size="0xF000"                   default="1"/>
            <algorithm  name="Flash/TLE9877_EEP.FLM"    start="0x1100F000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE987x BE-Step Series BootROM Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x BF-Step Series BootROM Manual"/>
            <book    name="Documents/TLE9877QXA40-Data-Sheet-10-Infineon.pdf"  title="TLE9877QXA40 Data Sheet - BE-Step"/>
            <book    name="Documents/TLE9877QXA40-BF-Data-Sheet-10-Infineon.pdf"  title="TLE9877QXA40 Data Sheet - BF-Step"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
          <device Dname="TLE9877QXW40">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9877QXW40;RTE_DEVICE_BF_STEP"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0xEFFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x1100EFFC"  size="0x1004"     startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"     init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x14"       init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9877.FLM"        start="0x11000000"  size="0xF000"                   default="1"/>
            <algorithm  name="Flash/TLE9877_EEP.FLM"    start="0x1100F000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x Series BootROM Manual"/>
            <book    name="Documents/TLE9877QXW40-BF-Data-Sheet-11-Infineon.pdf"  title="TLE9877QXW40 Data Sheet"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
          <device Dname="TLE9879QXA20">
            <processor Dclock="24000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9879QXA20"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0x1EFFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x1101EFFC"  size="0x1004"      startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"      init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x10"        init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9879.FLM"        start="0x11000000"  size="0x1F000"                   default="1"/>
            <algorithm  name="Flash/TLE9879_EEP.FLM"    start="0x1101F000"  size="0x1000"                    default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE987x BE-Step Series BootROM Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x BF-Step Series BootROM Manual"/>
            <book    name="Documents/TLE9879QXA20-Data-Sheet-10-Infineon.pdf"  title="TLE9879QXA20 Data Sheet - BE-Step"/>
            <book    name="Documents/TLE9879QXA20-BF-Data-Sheet-10-Infineon.pdf"  title="TLE9879QXA20 Data Sheet - BF-Step"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
          <device Dname="TLE9879QXA40">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9879QXA40"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0x1EFFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x1101EFFC"  size="0x1004"      startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"      init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x10"        init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9879.FLM"        start="0x11000000"  size="0x1F000"                   default="1"/>
            <algorithm  name="Flash/TLE9879_EEP.FLM"    start="0x1101F000"  size="0x1000"                    default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-13-Infineon.pdf"   title="TLE987x BE-Step Series BootROM Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x BF-Step Series BootROM Manual"/>
            <book    name="Documents/TLE9879QXA40-Data-Sheet-10-Infineon.pdf"  title="TLE9879QXA40 Data Sheet - BE-Step"/>
            <book    name="Documents/TLE9879QXA40-BF-Data-Sheet-10-Infineon.pdf"  title="TLE9879QXA40 Data Sheet - BF-Step"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
          <device Dname="TLE9879QXW40">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle987x.h" define="TLE9879QXW40;RTE_DEVICE_BF_STEP"/>
            <debug      svd="SVD/TLE987x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0x1EFFC"     startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x1101EFFC"  size="0x1004"      startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000018"  size="0x17E8"      init   ="0"   default="1"/>
            <memory     id="IRAM2"                      start="0x18000000"  size="0x14"        init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE9879.FLM"        start="0x11000000"  size="0x1F000"                   default="1"/>
            <algorithm  name="Flash/TLE9879_EEP.FLM"    start="0x1101F000"  size="0x1000"                    default="1"/>
            <book    name="Documents/TLE987xQX-Users-Manual-14-Infineon.pdf"   title="TLE987x Series Reference Manual"/>
            <book    name="Documents/TLE987xQX-BootROM-User-Manual-14-Infineon.pdf"   title="TLE987x Series BootROM Manual"/>
            <book    name="Documents/TLE9879QXW40-BF-Data-Sheet-11-Infineon.pdf"  title="TLE9879QXW40 Data Sheet"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
