mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE987x_DFP.1.4.2.pdsc
    <condition id="TLE987x_BF">
      <!-- conditions selecting Devices -->
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <accept condition="TLE9871QXA"/>
      <accept condition="TLE9877QXA"/>
      <accept condition="TLE9879QXA"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9871QXA">
      <description>Infineon TLE9871QXA20 device</description>
      <require Dvendor="Infineon:7" Dname="TLE9871QX*"/>
	</condition>

    <condition id="TLE9877QXA">
      <description>Infineon TLE9877QXAxx device</description>
      <require Dvendor="Infineon:7" Dname="TLE9877QXA*"/>
	</condition>

    <condition id="TLE9879QXA">
      <description>Infineon TLE9879QXAxx device</description>
      <require Dvendor="Infineon:7" Dname="TLE9879QXA*"/>
	</condition>
    
    <!--<condition id="TLE9871_BF">
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9871QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9877_BF">
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9877QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="TLE9879_BF">
      <description>Infineon TLE987x device series, BF-Step</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9879QXA*"/>
      <require Tcompiler="ARMCC"/>
    </condition>-->
    
  </conditions>

   <boards>
    <board vendor="Infineon" name="TLE9879 EvalKit" revision="V1.1" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE9879 EvalKit Board Support and Examples</description>
      <image small="Images/TLE9879_EvalKit_v1_top_small.jpg" large="Images/TLE9879_EvalKit_v1_top_large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE9879+EVALKIT/evaluation-boards/TLE9879+EVALKIT/productType.html?productType=5546d4624e765da5014eb4e2cc3f2fc5" title="TLE9879 EvalKit Web Page"/>
      <book category="setup"     name="Documents/TLE9879-EvalKit-UM-110-Infineon.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/TLE9879_Evalkit_Rev1.3.zip" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9879QXA40"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series" Dname="TLE9871QXA20"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series" Dname="TLE9873QXW40"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series" Dname="TLE9877QXA20"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series" Dname="TLE9877QXA40"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series" Dname="TLE9877QXW40"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series" Dname="TLE9879QXA20"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE987x Series" Dname="TLE9879QXW40"/>
          <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="12" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="13"             name="Pins at pin headers"/>
        <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
        <feature type="LED"       n="8"              name="User LEDs"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
    <board vendor="Infineon" name="TLE987x EvalBoard" revision="V1.2" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE987x EvalBoard Board Support and Examples</description>
      <image small="Images/TLE987X-EVALB_JLINK_low.png" large="Images/TLE987X-EVALB_JLINK.png_2136625930.png"/>
      <book category="overview"  name="https://www.infineon.com/cms/en/product/evaluation-boards/tle987x-evalb_jlink/" title="TLE9879 Eval.Board Web Page"/>
      <book category="setup"     name="Documents/IFX_TLE987x_EvalBoard.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/TLE987x_DUTplastic_rev1.2.zip" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9879-2QXA40"/>
          <feature type="ODbg"      n="1"              name="J-LINK Lite"/>
        <feature type="PWR"       n="12" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="13"             name="Pins at pin headers"/>
        <feature type="AIO"       n="3"              name="Analog inputs at AD"/>
        <feature type="LED"       n="8"              name="User LEDs"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="TLE987x CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon TLE987x device series</description>
      <files>
        <!--  include folder -->
        <!--file category="include" name="Device/Include/"/-->
        
        <!-- startup files -->
        <file category="source"  name="Device/Source/ARM/startup_tle987x.S" attr="config" version="1.0"/>

        <!-- system file -->      
        <file category="source"  name="Device/Source/system_tle987x.c"      attr="config" version="0.4.2"/>
        <file category="header"  name="Device/Include/system_tle987x.h"     attr="config" version="0.4.2"/>
        
        <file category="source"  name="Device/Source/tle_device.c"          attr="config" version="1.0.9"/>
        <file category="header"  name="Device/Include/tle_device.h"         attr="config" version="1.0.9"/>
        <file category="header"  name="Device/Include/tle_variants.h"       attr="config" version="0.1.1"/>

        <file category="source"  name="Device/Include/sfr_access.h"         attr="config" version="0.1.0"/>
        <file category="header"  name="Device/Include/types.h"              attr="config" version="0.2.3"/>
        <file category="header"  name="Device/Include/eval_board.h"         attr="config" version="0.2.0"/>
        <file category="header"  name="Device/Include/cmsis_misra.h"        attr="config" version="0.1.1"/>

        <file category="header"  name="Device/Include/tle987x.h"            attr="config" version="3.0.2"/>
        <file category="sourceC" name="Device/SDK/app/main.c"               attr="template" select="Simple Main" version="1.2.1"/>
        <file category="doc"     name="Documents/html/index.html"/>
     </files>
    </component>

    <!-- START: Infineon Standard Peripherals Low Level Drivers -->
    <component Cclass="Device" Cgroup="ConfigWizard" Cversion="1.8.6" condition="Only ConfigWizard">  <!-- Cversion is necessary -->
     <description>Infineon ConfigWizard Configuration File</description>
      <RTE_Components_h>
         #define CONFIGWIZARD 1
     </RTE_Components_h>
     <files>
        <file category="doc"    name="Device/SDK/cfgwiz/TLE987x_20/v1/config.icwp"              attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="doc"    name="Device/SDK/cfgwiz/TLE987x_40/v1/config.icwp"              attr="config" condition="TLE987x_40 no -2QXA40"  version="1.8.6"/>
        <file category="doc"    name="Device/SDK/cfgwiz/TLE9879_2/v1/config.icwp"               attr="config" condition="TLE9879_2QXA40"         version="1.8.6"/>
        
        <file category="doc"    name="SVD/TLE987x.svd"                                          attr="config" condition="TLE987x no -2QXA40"     version="3.9.0"/>
        <file category="doc"    name="SVD/TLE9879_2/TLE987x.svd"                                attr="config" condition="TLE9879_2QXA40"         version="4.0.0"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/v1/ICW_TLE987x.xml"              attr="config" condition="TLE987x no -2QXA40"     version="1.3.5"/>
        <file category="doc"    name="Device/SDK/cfgwiz/script/TLE9879_2/v1/ICW_TLE987x.xml"    attr="config" condition="TLE9879_2QXA40"         version="1.3.5"/> 
        
        <!-- sdadc_defines.h only for TLE9879_2 -->
        <file category="header" name="Device/SDK/cfgwiz/TLE9879_2/v1/sdadc_defines.h"           attr="config" condition="TLE9879_2QXA40"         version="1.8.6"/>

        <!-- _defines.h which contens are the same between both versions of the Config Wizard -->    
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/ccu6_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/ccu6_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/isr_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/isr_defines.h"            attr="config" condition="TLE987x_40 no -2QXA40"  version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE9879_2/v1/isr_defines.h"             attr="config" condition="TLE9879_2QXA40"         version="1.8.6"/>
                                                                                                
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/lin_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/lin_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
                                                                                                
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/ssc_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/ssc_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
                                                                                                
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/timer2x_defines.h"        attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/timer2x_defines.h"        attr="config" condition="TLE987x_40"             version="1.8.6"/>
                                                                                                
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/uart_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/uart_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/> 
        
        <!-- _defines.h for which you have to differentiate between both versions of the Config Wizard -->    
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/bsl_defines.h"            attr="config" condition="TLE987x_20"             version="1.8"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/bsl_defines.h"            attr="config" condition="TLE987x_40"             version="1.8"/>
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/scu_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/scu_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/pmu_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/pmu_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/adc1_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/adc1_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/> 
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/adc2_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/adc2_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/bdrv_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/bdrv_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/csa_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/csa_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/gpt12e_defines.h"         attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/gpt12e_defines.h"         attr="config" condition="TLE987x_40"             version="1.8.6"/>
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/int_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/int_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v1/mon_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v1/mon_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
        
