mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE987x_DFP.1.4.2.pdsc
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/pmu_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/pmu_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
        
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/adc1_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/adc1_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/adc2_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/adc2_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/bdrv_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/bdrv_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/csa_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/csa_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/gpt12e_defines.h"         attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/gpt12e_defines.h"         attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/int_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/int_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/> 

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/mon_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/mon_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/port_defines.h"           attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/port_defines.h"           attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/timer3_defines.h"         attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/timer3_defines.h"         attr="config" condition="TLE987x_40"             version="1.8.6"/>

        <file category="header" name="Device/SDK/cfgwiz/TLE987x_20/v2/dma_defines.h"            attr="config" condition="TLE987x_20"             version="1.8.6"/>
        <file category="header" name="Device/SDK/cfgwiz/TLE987x_40/v2/dma_defines.h"            attr="config" condition="TLE987x_40"             version="1.8.6"/>
     </files>
    </component>

    <component Cclass="Device" Cgroup="BF-Stepping" Cversion="0.0.1" condition="TLE987x_BF">
      <description>Select if target device is BF-Stepping</description>
      <RTE_Components_h>
        #define RTE_DEVICE_BF_STEP
      </RTE_Components_h>
      <files>
        <file category="doc" name="Documents/bf_stepping.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.3.6" condition="TLE987x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SCU
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/scu.h"   attr="config"   condition="TLE987x CMSIS Device"  version="0.3.6"/>
        <file category="source" name="Device/SDK/src/scu.c"   attr="config"   condition="TLE987x CMSIS Device"  version="0.3.6"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" Cversion="0.2.5" condition="TLE987x CMSIS Device">
      <description>BootROM driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_BROM
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/bootrom.h" attr="config" condition="TLE987x CMSIS Device" version="0.2.5"/>
        <file category="source" name="Device/SDK/src/bootrom.c" attr="config" condition="TLE987x CMSIS Device" version="0.2.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.9" condition="TLE987x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_WDT1
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/wdt1.h" attr="config" condition="TLE987x CMSIS Device" version="0.2.9"/>
        <file category="source" name="Device/SDK/src/wdt1.c" attr="config" condition="TLE987x CMSIS Device" version="0.2.9"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PMU" Cversion="0.1.7" condition="TLE987x CMSIS Device">
      <description>Power Management Unit (SCU) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PMU
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/pmu.h"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.7"/>
        <file category="source" name="Device/SDK/src/pmu.c"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC1" Cversion="0.2.4" condition="ADC">
      <description>Analog Digital Converter 1 (ADC1) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC1
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/adc1.h"    attr="config"  condition="TLE987x CMSIS Device"  version="0.2.4"/>
        <file category="source" name="Device/SDK/src/adc1.c"    attr="config"  condition="TLE987x CMSIS Device"  version="0.2.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ADC2" Cversion="0.1.9" condition="ADC">
      <description>Analog Digital Converter 2 (ADC2) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC2
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/adc2.h"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.9"/>
        <file category="source" name="Device/SDK/src/adc2.c"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.9"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SDADC" Cversion="0.1.2" condition="TLE9879_2QXA40_ADC34">
      <description>Sigma Delta ADC driver for TLE9879-2QXA40</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ADC34
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/sdadc.h"   attr="config" condition="TLE987x CMSIS Device" version="0.1.2"/>
        <file category="source" name="Device/SDK/src/sdadc.c"   attr="config" condition="TLE987x CMSIS Device" version="0.1.2"/>
      </files>
    </component>

