mdhardenburgh/Blinky/Packages/.cache/Infineon.TLE987x_DFP.1.4.2.pdsc
    <component Cclass="Device" Cgroup="SDK" Csub="BDRV" Cversion="0.4.3" condition="TLE987x CMSIS Device">
      <description>Bridge Driver (BDRV) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_BDRV
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/bdrv.h"    attr="config"  condition="TLE987x CMSIS Device"  version="0.4.3"/>
        <file category="source" name="Device/SDK/src/bdrv.c"    attr="config"  condition="TLE987x CMSIS Device"  version="0.4.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CCU6" Cversion="0.2.9" condition="TLE987x CMSIS Device">
      <description>Capture Compare Unit (CCU6) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_CCU6
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/ccu6.h"    attr="config" condition="TLE987x CMSIS Device"  version="0.2.9"/>
        <file category="source" name="Device/SDK/src/ccu6.c"    attr="config" condition="TLE987x CMSIS Device"  version="0.2.9"/>
        </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="CSA" Cversion="0.1.4" condition="ADC">
      <description>Current Sense Amplifier (CSA) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_CSA
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/csa.h"    attr="config"  condition="TLE987x CMSIS Device" version="0.1.4"/>
        <file category="source" name="Device/SDK/src/csa.c"    attr="config"  condition="TLE987x CMSIS Device" version="0.1.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="GPT12E" Cversion="0.1.8" condition="TLE987x CMSIS Device">
      <description>General Purpose Timer 12E (GPT12E) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_GPT12E
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/gpt12e.h"   attr="config" condition="TLE987x CMSIS Device" version="0.1.8"/>
        <file category="source" name="Device/SDK/src/gpt12e.c"   attr="config" condition="TLE987x CMSIS Device" version="0.1.8"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="INT" Cversion="0.1.9" condition="TLE987x CMSIS Device">
      <description>Interrupt (INT) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_INT
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/int.h"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.9"/>
        <file category="source" name="Device/SDK/src/int.c"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.9"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="ISR" Cversion="0.2.5" condition="TLE987x CMSIS Device">
      <description>Interrupt Service Routines (ISR) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_ISR
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/isr.h"    attr="config"  condition="TLE987x CMSIS Device" version="0.2.5"/>
        <file category="source" name="Device/SDK/src/isr.c"    attr="config"  condition="TLE987x CMSIS Device" version="0.2.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="LIN" Cversion="0.1.7" condition="TLE987x CMSIS Device">
      <description>LIN Tranceiver (LIN) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_LIN
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/lin.h"   attr="config" condition="TLE987x CMSIS Device" version="0.1.7"/>
        <file category="source" name="Device/SDK/src/lin.c"   attr="config" condition="TLE987x CMSIS Device" version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="MON" Cversion="0.1.4" condition="TLE987x CMSIS Device">
      <description>High Voltage Monitor Input (MON) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_MON
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/mon.h"   attr="config" condition="TLE987x CMSIS Device"  version="0.1.4"/>
        <file category="source" name="Device/SDK/src/mon.c"   attr="config" condition="TLE987x CMSIS Device"  version="0.1.4"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="PORT" Cversion="0.5.5" condition="TLE987x CMSIS Device">
      <description>GPIO Ports (PORT) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_PORT
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/port.h"  attr="config" condition="TLE987x CMSIS Device"  version="0.5.5"/>
        <file category="source" name="Device/SDK/src/port.c"  attr="config" condition="TLE987x CMSIS Device"  version="0.5.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SSC" Cversion="0.1.5" condition="TLE987x CMSIS Device">
      <description>High Speed Synchronous Serial Interface 1 and 2 (SSC) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SSC
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/ssc.h"    attr="config" condition="TLE987x CMSIS Device" version="0.1.5"/>
        <file category="source" name="Device/SDK/src/ssc.c"    attr="config" condition="TLE987x CMSIS Device" version="0.1.5"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="TIMER2x" Cversion="0.1.7" condition="TLE987x CMSIS Device">
      <description>Timer2 and Timer21 (TIMER2x) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER2X
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/timer2x.h"    attr="config" condition="TLE987x CMSIS Device"  version="0.1.7"/>
        <file category="source" name="Device/SDK/src/timer2x.c"    attr="config" condition="TLE987x CMSIS Device"  version="0.1.7"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="TIMER3" Cversion="0.1.5" condition="TLE987x CMSIS Device">
      <description>Timer3 (TIMER3) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_TIMER3
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/timer3.h"    attr="config" condition="TLE987x CMSIS Device"  version="0.1.5"/>
        <file category="source" name="Device/SDK/src/timer3.c"    attr="config" condition="TLE987x CMSIS Device"  version="0.1.5"/>
        </files>
    </component>
    
    <component Cclass="Device" Cgroup="SDK" Csub="UART" Cversion="0.1.8" condition="TLE987x CMSIS Device">
      <description>UART1 and UART2 (UART) driver for TLE987x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_UART
      </RTE_Components_h>  
      <files>
        <file category="header" name="Device/SDK/inc/uart.h"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.8"/>
        <file category="source" name="Device/SDK/src/uart.c"    attr="config"  condition="TLE987x CMSIS Device"  version="0.1.8"/>
      </files>
    </component>
    
